Revit 2027 API
IFCParameterTemplate.ExportRevitSchedules Property
 The option to export Revit schedules to IFC. If true, then all Revit schedules not excluded will be exported. If false, then no Revit schedules will be exported.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ExportRevitSchedules { get; set; }
Public Property ExportRevitSchedules As Boolean
	Get
	Set
public:
property bool ExportRevitSchedules {
	bool get ();
	void set (bool value);
}
member ExportRevitSchedules : bool with get, set
Property Value
Boolean
See Also
Reference
IFCParameterTemplate Class
Autodesk.Revit.DB Namespace